Tutorials-2.3.0/incompressible/cylinder-re100-1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoCentralFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.005;

deltaT          2e-07;//2e-05;

writeControl    adjustableRunTime;

writeInterval   1e-5;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.2;

maxDeltaT       1;

functions
{

    forces
    {
	type            forceCoeffs;
	functionObjectLibs ( "libforces.so" );
	outputControl   timeStep;
	outputInterval  1;

	patches
	(
	    cyl-walls
	);

	pName       p;
	UName       U;
	log         true;
	rhoInf      1.17404;
	CofR        ( 0 0 0 );
	liftDir     ( 0 1 0 );
	dragDir     ( 1 0 0 );
	pitchAxis   ( 0 0 1 );
	magUInf     10;
	lRef        0.157575e-3;
	Aref        2.48283049e-09;
    }
}


// ************************************************************************* //
